#include "function.h"
#include "interprete.h"
#include "interprete.h"
function::function() {}

void welcome()
{
    Utils::print(R"(##############################################
                             _____  ____  __  __  _____
                            |  __ \|  _ \|  \/  |/ ____|
                            | |  | | |_) | \  / | (___
                            | |  | |  _ <| |\/| |\___ \
                            | |__| | |_) | |  | |____) |
                            |_____/|____/|_|  |_|_____/

                             -> exit:退出 help:语法帮助 <-

                    ##############################################
          )");
}
